spec/fixtures/vcr_cassettes/SetUserAccessLevelFromSubscriptions/_call/sets_a_user_with_a_subscribed_access_level_to_freemium_when_their_subscription_ends.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/customers/<TEST_STRIPE_CUSTOMER_ID_WITHOUT_ACTIVE_SUBSCRIPTION>
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/5.32.1
      Authorization:
      - Bearer <STRIPE_SECRET_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_RqqvloIOkDMmKP","request_duration_ms":653}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"5.32.1","lang":"ruby","lang_version":"2.5.1 p57 (2018-03-29)","platform":"x86_64-darwin19","engine":"ruby","publisher":"stripe","uname":"Darwin
        MacBook-Pro-2.local 19.6.0 Darwin Kernel Version 19.6.0: Thu Sep 16 20:58:47
        PDT 2021; root:xnu-6153.141.40.1~1/RELEASE_X86_64 x86_64","hostname":"MacBook-Pro-2.local"}'
      Expand:
      - subscriptions
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 30 Sep 2021 19:22:28 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1929'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_ONElFG6ajZoJiW
      Stripe-Version:
      - '2018-10-31'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "<TEST_STRIPE_CUSTOMER_ID_WITHOUT_ACTIVE_SUBSCRIPTION>",
          "object": "customer",
          "account_balance": 0,
          "address": null,
          "balance": 0,
          "created": 1633028769,
          "currency": "usd",
          "default_source": "card_1JfUa5FiUwJySKD84IrGnRzb",
          "delinquent": false,
          "description": "(created by Stripe CLI)",
          "discount": null,
          "email": null,
          "invoice_prefix": "6B755900",
          "invoice_settings": {
            "custom_fields": null,
            "default_payment_method": null,
            "footer": null
          },
          "livemode": false,
          "metadata": {
          },
          "name": null,
          "next_invoice_sequence": 2,
          "phone": null,
          "preferred_locales": [

          ],
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [
              {
                "id": "card_1JfUa5FiUwJySKD84IrGnRzb",
                "object": "card",
                "address_city": null,
                "address_country": null,
                "address_line1": null,
                "address_line1_check": null,
                "address_line2": null,
                "address_state": null,
                "address_zip": null,
                "address_zip_check": null,
                "brand": "Visa",
                "country": "US",
                "customer": "<TEST_STRIPE_CUSTOMER_ID_WITHOUT_ACTIVE_SUBSCRIPTION>",
                "cvc_check": null,
                "dynamic_last4": null,
                "exp_month": 9,
                "exp_year": 2022,
                "fingerprint": "wfneDVrNGDlI6Y6S",
                "funding": "credit",
                "last4": "4242",
                "metadata": {
                },
                "name": null,
                "tokenization_method": null
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/<TEST_STRIPE_CUSTOMER_ID_WITHOUT_ACTIVE_SUBSCRIPTION>/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [

            ],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/<TEST_STRIPE_CUSTOMER_ID_WITHOUT_ACTIVE_SUBSCRIPTION>/subscriptions"
          },
          "tax_exempt": "none",
          "tax_ids": {
            "object": "list",
            "data": [

            ],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/<TEST_STRIPE_CUSTOMER_ID_WITHOUT_ACTIVE_SUBSCRIPTION>/tax_ids"
          },
          "tax_info": null,
          "tax_info_verification": null
        }
  recorded_at: Thu, 30 Sep 2021 19:22:29 GMT
recorded_with: VCR 6.0.0
